In [4]:
import pandas as pd
import numpy as np

# pd.concat(objs, axis)
데이터의 속성 형태가 동일한 데이터셋끼리 합칠 때 사용.
- R의 `rbind()`, `cbind()`와 유사함.

Parameter 설명

**objs**
- pd.concat()을 사용해 합칠 두 데이터셋.
<br><br>

**axis**
- axis=0이면 위 아래로 합치기, axis=1이면 왼쪽 오른쪽으로 합치기.

In [6]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2'],'C': ['C0', 'C1', 'C2'],'D': ['D0', 'D1', 'D2']},index=[0, 1, 2])
df_2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],'B': ['B3', 'B4', 'B5'],'C': ['C3', 'C4', 'C5'],'D': ['D3', 'D4', 'D5']},index=[3, 4, 5])

In [7]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [8]:
df_2

    A   B   C   D
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [9]:
# axis=0: 위 아래로 합칠 때
pd.concat([df_1, df_2], axis=0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [10]:
# axis=1: 왼쪽 오른쪽으로 합칠 때
pd.concat([df_1, df_2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   A3   B3   C3   D3
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5

# pd.get_dummies
categorical feature를 dummy variable들로 전환. One-hot encoding 방식.

**Parameters**: data, columns, prefix

In [ ]:
# 예제
dataset = pd.get_dummies(dataset, columns=['Title'])
dataset = pd.get_dummies(dataset, columns=['Embarked'], prefix='Em')

# pd.drop()
row나 column을 삭제할 수 있다. row나 column이나 이름을 명시하면 쉽게 지울수 있다. **inplace 잘못하면 큰일난다.**

Parameter 설명

**axis**
- axis=0이면 row, axis=1이면 column.
- inplace를 True로 하면 기존의 df을 drop한 df로 대체한다.

In [27]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2'],'C': ['C0', 'C1', 'C2'],'D': ['D0', 'D1', 'D2']},index=['a', 'b', 'c'])
df_1

    A   B   C   D
a  A0  B0  C0  D0
b  A1  B1  C1  D1
c  A2  B2  C2  D2

In [28]:
df_1 = df_1.drop('a')
df_1

    A   B   C   D
b  A1  B1  C1  D1
c  A2  B2  C2  D2

In [21]:
df_1 = df_1.drop('D', axis=1)
df_1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

# pd.reset_index()
기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 추가.

Parameter 설명

**drop**
- Default 값은 False. True면 기존의 인덱스는 버린다.

In [31]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2'],'C': ['C0', 'C1', 'C2'],'D': ['D0', 'D1', 'D2']},index=['a', 'b', 'c'])
df_1 = df_1.drop('a').reset_index()
df_1

  index   A   B   C   D
0     b  A1  B1  C1  D1
1     c  A2  B2  C2  D2

In [32]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2'],'C': ['C0', 'C1', 'C2'],'D': ['D0', 'D1', 'D2']},index=['a', 'b', 'c'])
df_1 = df_1.drop('a').reset_index(drop=True)
df_1

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2

# df.columns

컬럼 이름을 출력.

In [15]:
df = pd.DataFrame({"A":[1,4,7], "B":[2,5,8], "C":[3,6,9]})
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

# loc vs. iloc

- loc[]은 **인덱스** 기준으로 인덱싱과 슬라이싱 진행.
- iloc[]은 **행번호** 기준으로 인덱싱과 슬라이싱 진행.